PGM        PARM(&PARM &PARM2 &PARMLIN &PARMCHAIR)
DCL        VAR(&PARM) TYPE(*CHAR) LEN(10)
DCL        VAR(&PARM2) TYPE(*CHAR) LEN(10)
DCL        VAR(&PARMLIN) TYPE(*CHAR) LEN(2)
DCL        VAR(&PARMCHAIR) TYPE(*CHAR) LEN(2)

/* CALL RPG PROGRAM PASSING PARAMETERS */
CALL       PGM(WDACAS) PARM(&PARM &PARM2 &PARMLIN &PARMCHAIR)

ENDPGM
